package com.sluzbenik.rest.controller;

import org.springframework.stereotype.Controller;
import org.springframework.web.bind.annotation.RequestMapping;
import org.springframework.web.bind.annotation.RestController;

@RequestMapping("api/gradjanin")
@RestController
//4. претражује архиву докумената која припада грађанину (сагласност, потврда,
//        сертификат)
//        ● претрагу докумената по текстуалном садржају (тј. основну претрагу)
//        имплементирати кроз засебну форму на којој је корисницима омогућен унос
//        фраза или кључних речи по којима се врши претрага над свим елементима
//        документа који садрже дате појмове;
//        ● имплементирати претрагу докумената по метаподацима (тј. напредна
//        претрага);
//        ● претрагу докумената по више метаподатака реализовати употребом логичких
//        оператора;
//        ● приликом прегледања докумената омогућити линк на референциране
//        документе, а у форми за претрагу омогућити проналажење свих докумената
//        који референцирају дати документ;
//        ● приликом моделовања документа као XML документа, посебно обратити
//        пажњу на поља која представљају метаподатке и обратити пажњу на могуће
//        референце на друге документе, а на основу којих ће бити имплементирана
//        напредна претрага;
//        ● сваки документ који се пронађе може да се извезе у XHTML и PDF форматима.
public class DokumentController {

}
